Revit 2026 API

# DocumentConvertSymbolicToModelCurves Method

---

Converts a group of SymbolicCurves to equivalent ModelCurves.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelCurveArray ConvertSymbolicToModelCurves(
	View view,
	SymbolicCurveArray symbolicCurve
)
```
```vb
Public Function ConvertSymbolicToModelCurves (
	view As View,
	symbolicCurve As SymbolicCurveArray
) As ModelCurveArray
```
```cpp
public:
ModelCurveArray^ ConvertSymbolicToModelCurves(
	View^ view,
	SymbolicCurveArray^ symbolicCurve
)
```
```fsharp
member ConvertSymbolicToModelCurves :
        view : View *
        symbolicCurve : SymbolicCurveArray -> ModelCurveArray
```

#### Parameters

view View
    The view where the new lines will be created. The lines are projected on the view workplane. The view workplane must be parallel to the view plane.
symbolicCurve SymbolicCurveArray
     The symbolic curve array to be converted.

#### Return Value

ModelCurveArray

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument is . |
| InvalidOperationException | Thrown when one or more curves could not be successfully converted. |

This operation will create new ModelCurves with the symbolicCurves' geometry curves and delete the SymbolicCurve in the array.

#### Reference

Document Class

Autodesk.Revit.DB Namespace